Repository: SengPricha/Khmer-Yuki
Catalog: lib/l10n/app_*.arb
Languages: km

source: Settings
km: ការកំណត់

source: Dark Mode
km: ងងឹត

source: Light Mode
km: ពន្លឺ

source: Khmer
km: ខ្មែរ

# titleMoney
source: You don't have enough money!
km: អ្នកមានលុយមិនគ្រប់គ្រាន់ទេ!

# selectMoney
source: Select a money note
km: ជ្រើសរើសសន្លឹកលុយ

# txtMoney
source: Please choose the animal you want to bet on first!
km: សូមជ្រើសរើសសត្វដែលអ្នកចង់ចាក់ជាមុនសិន!

source: English
km: អង់គ្លេស

# start
source: Start Game
km: ចាប់ផ្ដើម

# about
source: About Game
km: អំពីហ្គេម

source: Close
km: បិទ

# ready
source: Get ready!
km: ត្រៀម ត្រៀម!

# title
source: Support popular traditional games from our community
km: គាំទ្រល្បែងប្រជាប្រិយក្នុងស្រុកយើង

source: Your Money
km: លុយរបស់អ្នក

# getmoney
source: You received 50,000៛!
km: អ្នកទទួលបានលុយ 50,000៛!

source: Add Money
km: បន្ថែមលុយ

# result
source: Bet placed, hands off!
km: ចាក់ហើយដកដៃ!

source: Open
km: បើក

source: Restart
km: ចាប់ផ្ដើម

# betWonMessage
source: You won the bet and received {winnings} Riel
km: អ្នកចាក់សត្វត្រូវ ហើយទទួលបាន {winnings} ៛

source: You Win 🎉
km: អ្នកឈ្នះ 🎉

# youlose
source: Your Lost😞
km: អ្នកចាក់អត់ត្រូវទេ😞

# txtbox
source: Bot is win
km: មេស៊ីអស់ហើយ

source: No
km: ទេ

source: Yes
km: បាទ/ចាស៎

# exitText
source: Do you want to exit?
km: តើអ្នកចង់ចាកចេញទេ?

# aboutText
source: This Khmer Yuki game is similar to the traditional Kla Klok Game, but it features the 12 zodiac animals.How to play: - If you want to place a bet on an animal, simply tap on that animal. - Each tap places a bet of 10,000 riel or more. If you want to bet more, just tap the animal multiple times the total bet amount will increase accordingly. - If your chosen animal wins, you receive 10 times your bet plus your original amount.Example: If you bet 10,000៛ and win, you will receive 110,000៛.
km: ហ្គេមខ្មែរយូគីនេះមានលក្ខណៈស្រដៀងទៅនឹងហ្គេមខ្លាឃ្លោកដែរ ប៉ុន្តែហ្គេមនេះមានលក្ខណៈសត្វឆ្នាំទាំង១២។ របៀបលេង៖ - ប្រសិនបើអ្នកចង់ចាក់ទៅលើសត្វមួយណាដោយគ្រាន់តែចុចទៅលើសត្វនោះជាការស្រេច។ - ការចាក់ម្ដង 10,000 រៀលឡើងទៅ តែប្រសិនបើអ្នកចង់ចាក់ច្រើនជាងនេះទៀតអ្នកគ្រាន់តែចុចទៅលើសត្វនោះជាច្រើនដងនោះតម្លៃលុយរបស់អ្នកចាក់នឹងឡើងតាមនឹង ។ - ប្រសិនបើអ្នកចាក់ត្រូវ ១ សងនឹង ១០ បូកជាមួយលុយដើមវិញទៀត។ឧ: 10,000៛ ចាក់ត្រូវបាន 110,000៛

# exit
source: Exit Game
km: ចាកចេញ

# currentLanguage
source: Language: {language}
km: ភាសា: {language}

# englishButton
source: ខ្មែរ
km: ENGLISH

# khmerButton
source: ENGLISH
km: ខ្មែរ
